lsh0223/stm32websystem/stm32Project/USER/main.c
#include "sys.h"
#include "delay.h"
#include "usart.h"
#include "lcd.h"
#include "text.h"
#include "fontupd.h"
#include "w25qxx.h"
#include "touch.h"
#include "seat_bsp.h"
#include "rfid_app.h"
#include "esp8266.h"
#include <string.h>
#include <stdio.h>

// --- UI 坐标定义 ---
void LCD_Display_Dir(u8 dir);  

// ★★★ 修改：移除宏定义，改为变量，默认 1.0 ★★★
// #define PRICE_PER_MIN       1  
float g_price_per_min = 1.0f;     

#define BTN_PC_X1           20
#define BTN_PC_Y1           170
#define BTN_PC_X2           140
#define BTN_PC_Y2           210
#define BTN_LIGHT_X1        180
#define BTN_LIGHT_Y1        170
#define BTN_LIGHT_X2        300
#define BTN_LIGHT_Y2        210
#define BTN_EXIT_X1         80
#define BTN_EXIT_Y1         220
#define BTN_EXIT_X2         240
#define BTN_EXIT_Y2         260
#define CONF_X1             40
#define CONF_Y1             130
#define CONF_X2             280
#define CONF_Y2             260
#define CONF_BTN_OK_X1      (CONF_X1 + 20)
#define CONF_BTN_OK_Y1      (CONF_Y2  - 50)
#define CONF_BTN_OK_X2      (CONF_X1 + 100)
#define CONF_BTN_OK_Y2      (CONF_Y2  - 20)
#define CONF_BTN_CANCEL_X1  (CONF_X2  - 100)
#define CONF_BTN_CANCEL_Y1  (CONF_Y2  - 50)
#define CONF_BTN_CANCEL_X2  (CONF_X2  - 20)
#define CONF_BTN_CANCEL_Y2  (CONF_Y2  - 20)

extern char esp8266_remote_uid[32]; 

// --- 类型定义 ---
typedef enum { STATE_IDLE = 0, STATE_INUSE } app_state_t;
typedef enum { SCREEN_WELCOME = 0, SCREEN_INUSE, SCREEN_CONFIRM, SCREEN_MAINTENANCE } screen_t;
typedef enum { CONFIRM_NONE = 0, CONFIRM_PC_OFF, CONFIRM_EXIT } confirm_type_t;

typedef struct {
    app_state_t   state;        
    u8            has_user;     
    u8            uid[4];       
    u8            user_name[32]; 
    u32           balance;      
    u32           used_seconds; 
    u8            pc_on;        
    u8            light_on;     
    u8            maint_mode;   
} app_ctx_t;

// --- 全局变量 ---
static app_ctx_t      g_app;
static screen_t       g_screen      = SCREEN_WELCOME;
static confirm_type_t g_confirm     = CONFIRM_NONE;
static u8             g_touch_down  = 0;     
static u32 g_last_1s   = 0;   
static u32 g_last_mqtt = 0;   
static u32 g_idle_human_seconds = 0;   
static u8  g_idle_occupy_alarm  = 0;   
static u8  g_smoke_alarm        = 0;   
static u8  g_server_msg_secs = 0;
static u8  g_wait_card_auth        = 0;
static u32 g_card_auth_tick        = 0;
static u32 g_inuse_nohuman_seconds = 0;
static u32 publish_seq = 0;
static u32 g_card_cooldown_tick    = 0;

// --- 函数声明 ---
static void App_InitContext(void);
static void UI_DrawSplashScreen(void);
static void UI_DrawWelcomeStatic(void);
static void UI_DrawInuseStatic(void);
static void UI_DrawMaintenanceStatic(void); 
static void UI_DrawAlarmWindow(const char* title, const char* msg); 
static void UI_ClearAlarmWindow(void);      
static void UI_UpdateEnvWelcome(u8 human, u8 smoke_percent);
static void UI_UpdateEnvInuse(u8 human, u8 smoke_percent);
static void UI_UpdateStateLine(void);
static void UI_UpdateUserLine(void);
static void UI_UpdateCardLine(void);
static void UI_UpdateBalanceLine(void);
static void UI_UpdateRuntimeAndFee(void);
static void UI_UpdatePCButton(void);
static void UI_UpdateLightButton(void);
static void UI_UpdateWifiIcon(void);
static void UI_ShowServerMsg(const char *msg); 
static void UI_ClearServerMsg(void);           
static u8   Smoke_AdcToPercent(u16 adc);
static u8* Smoke_LevelText(u8 percent);
static void App_OnCard(u8 *uid);
static void App_EndSession(void);
static void UI_ShowConfirmDialog(confirm_type_t type);
static void App_HandleTouch(void);
static void Netbar_Publish_SeatState(void);      
static void App_Task_1s(void);                   
static void UID_ToHex(const u8 *uid, char *out);
static void UID_HexStr_To_Bytes(const char *str, u8 *out_uid);

// --- 主函数 ---
int main(void)
{
    u8  font_res;
    u8  human;
    u16 smoke_adc;
    u8  smoke_percent;
    u8  uid[4] = {0};
    u32 now;

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    delay_init(168);
    uart_init(115200);
    Seat_BSP_Init();      
    RFID_AppInit();       
    LCD_Init();
    LCD_Display_Dir(0);   
    LCD_Clear(WHITE);

    // 1. 先初始化字库
    font_res = font_init();  
    if (font_res) {
        LCD_Clear(WHITE);
        LCD_ShowString(10, 10, 300, 16, 16, (u8 *)"Font init error!");
        LCD_ShowString(10, 30, 300, 16, 16, (u8 *)"Please check W25QXX");
        while (1); 
    }

    // 2. 再显示开机画面
    UI_DrawSplashScreen();
    delay_ms(2000); 

    TP_Init();            
    App_InitContext();    
    ESP8266_Init_Async();                         

    g_screen  = SCREEN_WELCOME;
    g_confirm = CONFIRM_NONE;
    UI_DrawWelcomeStatic();  

    human         = Seat_Radar_Get();
    smoke_adc     = Seat_Smoke_GetRaw();
    smoke_percent = Smoke_AdcToPercent(smoke_adc);
    if (g_screen == SCREEN_WELCOME) UI_UpdateEnvWelcome(human, smoke_percent);
    else UI_UpdateEnvInuse(human, smoke_percent);

    g_last_1s = GetSysMs();
    g_last_mqtt = GetSysMs();

    while (1)
    {
        ESP8266_Poll();
        tp_dev.scan(0);
        App_HandleTouch();

        now = GetSysMs();

        // 蜂鸣器逻辑：只有在【有报警】且【不在维护模式】时才响
        if ((g_idle_occupy_alarm || g_smoke_alarm) && (g_app.maint_mode == 0)) {
            // 200ms一个周期：100ms响，100ms停 (急促)
            if ((now % 200) < 100) Seat_Buzzer_Set(1);
            else Seat_Buzzer_Set(0);
        } else {
            Seat_Buzzer_Set(0); // 必须静音
        }

        // 维护模式禁止刷卡
        if ((g_screen == SCREEN_WELCOME) && (g_app.state == STATE_IDLE) && (g_app.maint_mode == 0)) {
            if (g_wait_card_auth == 0 && now > g_card_cooldown_tick) {
                if (RFID_CheckCard(uid)) {
                    App_OnCard(uid);
                    g_card_cooldown_tick = now + 3000; 
                }
            }
        }

        if (now - g_last_1s >= 1000) {
            if (now - g_last_1s > 5000) g_last_1s = now;
            else g_last_1s += 1000;
            App_Task_1s();
        }

        if (ESP8266_GetState() == WIFI_STATE_RUNNING) {
            if (now - g_last_mqtt >= 1000) {
                if (now - g_last_mqtt > 5000) g_last_mqtt = now;
                else g_last_mqtt += 1000;
                Netbar_Publish_SeatState();
            }
        }
    }
}

