lsh0223/stm32websystem/stm32Project/USER/main.c
static void App_InitContext(void)
{
    g_app.state        = STATE_IDLE;
    g_app.has_user     = 0;
    memset(g_app.uid, 0, 4);
    strcpy((char *)g_app.user_name, "--");
    g_app.balance      = 0;        
    g_app.used_seconds = 0;
    g_app.pc_on        = 0;
    g_app.light_on     = 0;
    g_app.maint_mode   = 0;        

    Seat_PC_Set(0);
    Seat_Light_Set(0);
    Seat_Buzzer_Set(0);

    g_idle_human_seconds    = 0;
    g_idle_occupy_alarm     = 0;
    g_smoke_alarm           = 0;
    g_inuse_nohuman_seconds = 0;
    g_wait_card_auth        = 0;
    g_server_msg_secs       = 0;
}

// --- 界面绘制函数 ---

static void UI_DrawSplashScreen(void) {
    LCD_Clear(BLUE);
    POINT_COLOR = WHITE;
    BACK_COLOR  = BLUE;
    Show_Str(30, 100, 240, 24, (u8 *)"智能无人网吧系统", 24, 0);
    Show_Str(80, 140, 200, 16, (u8 *)"System Init...", 16, 0);
    Show_Str(60, 280, 200, 16, (u8 *)"By: Student", 16, 0);
}

static void UI_DrawMaintenanceStatic(void) {
    LCD_Clear(WHITE);
    LCD_Fill(0, 0, lcddev.width - 1, 40, BLUE);
    POINT_COLOR = WHITE;
    BACK_COLOR  = BLUE;
    Show_Str(10, 10, 240, 24, (u8 *)"设备维护中", 24, 0);
    UI_UpdateWifiIcon();
    LCD_Fill(40, 100, 280, 220, YELLOW);
    LCD_DrawRectangle(40, 100, 280, 220);
    POINT_COLOR = RED;
    BACK_COLOR  = YELLOW;
    Show_Str(80, 130, 200, 24, (u8 *)"暂停服务", 24, 0);
    POINT_COLOR = BLACK;
    Show_Str(60, 170, 240, 16, (u8 *)"工程师正在维护...", 16, 0);
}

static void UI_DrawAlarmWindow(const char* title, const char* msg) {
    u16 x = 30, y = 80, w = 260, h = 120;
    LCD_Fill(x, y, x+w, y+h, RED);
    LCD_DrawRectangle(x, y, x+w, y+h);
    LCD_DrawRectangle(x+2, y+2, x+w-2, y+h-2); 
    POINT_COLOR = WHITE;
    BACK_COLOR  = RED;
    Show_Str(x+20, y+30, 200, 24, (u8 *)title, 24, 0);
    Show_Str(x+20, y+70, 220, 16, (u8 *)msg, 16, 0);
}

static void UI_ClearAlarmWindow(void) {
    if (g_screen == SCREEN_WELCOME) {
        UI_DrawWelcomeStatic();
    }
    else if (g_screen == SCREEN_INUSE) {
        UI_DrawInuseStatic(); 
        UI_UpdateStateLine();
        UI_UpdateUserLine();
        UI_UpdateCardLine();
        UI_UpdateBalanceLine();
        UI_UpdateRuntimeAndFee();
        UI_UpdatePCButton();
        UI_UpdateLightButton();
    }
    else if (g_screen == SCREEN_MAINTENANCE) {
        UI_DrawMaintenanceStatic();
    }
}

static void UI_DrawWelcomeStatic(void) {
    char buf[64];
    LCD_Clear(WHITE);
    LCD_Fill(0, 0, lcddev.width - 1, 30, BLUE);
    POINT_COLOR = WHITE; BACK_COLOR = BLUE;
    Show_Str(10, 5, lcddev.width - 90, 24, (u8 *)"智能无人网吧系统", 24, 0); 
    UI_UpdateWifiIcon();   
    POINT_COLOR = BLACK; BACK_COLOR = WHITE;
    Show_Str(10, 40, lcddev.width - 20, 16, (u8 *)"欢迎使用", 16, 0);
    // ★★★ 修改：动态显示费率 ★★★
    sprintf(buf, "费率: %.1f元/分钟", g_price_per_min);
    Show_Str(10, 60, lcddev.width - 20, 16, (u8 *)buf, 16, 0);
    Show_Str(10, 90,  80, 16, (u8 *)"座位:", 16, 0);
    Show_Str(10, 110, 80, 16, (u8 *)"烟雾:", 16, 0);
    LCD_Fill(70, 90,  lcddev.width - 10, 106, WHITE);
    LCD_Fill(70, 110, lcddev.width - 10, 126, WHITE);
    LCD_Fill(10, 150, lcddev.width - 10, 190, GRAY);
    POINT_COLOR = BLUE; BACK_COLOR  = GRAY;
    if (g_app.maint_mode) Show_Str(20, 160, lcddev.width - 40, 16, (u8 *)"维护中，请勿上机", 16, 0);
    else Show_Str(20, 160, lcddev.width - 40, 16, (u8 *)"请刷卡上机", 16, 0);
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    // ★★★ 修改：动态显示费率 ★★★
    sprintf(buf, "费率:%.1f元/分钟", g_price_per_min);
    Show_Str(10, 210, lcddev.width - 20, 16, (u8 *)buf, 16, 0);
    LCD_Fill(10, 230, lcddev.width - 10, 250, WHITE);
}

static void UI_DrawInuseStatic(void) {
    char buf[64];
    LCD_Clear(WHITE);
    LCD_Fill(0, 0, lcddev.width - 1, 30, BLUE);
    POINT_COLOR = WHITE; BACK_COLOR  = BLUE;
    Show_Str(10, 5, lcddev.width - 90, 24, (u8 *)"上机中", 24, 0); 
    UI_UpdateWifiIcon();
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    // ★★★ 修改：动态显示费率 ★★★
    sprintf(buf, "费率: %.1f元/分钟", g_price_per_min);
    Show_Str(10, 32, lcddev.width - 20, 16, (u8 *)buf, 16, 0);
    Show_Str(10, 50,  70, 16, (u8 *)"状态:", 16, 0);
    Show_Str(10, 70,  70, 16, (u8 *)"用户:", 16, 0);
    Show_Str(10, 90,  70, 16, (u8 *)"卡号:", 16, 0);
    Show_Str(10, 110, 70, 16, (u8 *)"余额:", 16, 0);
    Show_Str(10, 130, 70, 16, (u8 *)"时长:", 16, 0);
    Show_Str(10, 150, 70, 16, (u8 *)"费用:", 16, 0);
    LCD_DrawRectangle(BTN_PC_X1, BTN_PC_Y1, BTN_PC_X2, BTN_PC_Y2);             
    LCD_DrawRectangle(BTN_LIGHT_X1, BTN_LIGHT_Y1, BTN_LIGHT_X2, BTN_LIGHT_Y2); 
    LCD_DrawRectangle(BTN_EXIT_X1, BTN_EXIT_Y1, BTN_EXIT_X2, BTN_EXIT_Y2);     
    Show_Str(10, 280, 80, 16, (u8 *)"座位:", 16, 0);
    Show_Str(10, 300, 80, 16, (u8 *)"烟雾:", 16, 0);
    // ★★★ 修改：动态显示费率 ★★★
    sprintf(buf, "费率:%.1f元/分钟", g_price_per_min);
    Show_Str(10, 320, 120, 16, (u8 *)buf, 16, 0);
    LCD_Fill(70, 280, lcddev.width - 10, 336, WHITE);
}

static void UI_ShowServerMsg(const char *msg) {
    u16 x = 10;
    u16 y = lcddev.height - 24;   
    u16 w = lcddev.width - 20;
    u16 h = 20;
    LCD_Fill(x, y, x + w, y + h, GRAY);
    POINT_COLOR = BLACK;
    BACK_COLOR  = GRAY;
    Show_Str(x + 4, y + 2, w - 8, 16, (u8 *)msg, 16, 0);
}

static void UI_ClearServerMsg(void) {
    u16 x = 10;
    u16 y = lcddev.height - 24;
    u16 w = lcddev.width - 20;
    u16 h = 20;
    LCD_Fill(x, y, x + w, y + h, WHITE);
}

static void UI_UpdateEnvWelcome(u8 human, u8 smoke_percent) { char buf[16]; u8 *level; LCD_Fill(70, 90, lcddev.width - 10, 106, WHITE); if (human) { POINT_COLOR = RED; Show_Str(70, 90, lcddev.width - 80, 16, (u8 *)"有人", 16, 0); } else { POINT_COLOR = BLACK; Show_Str(70, 90, lcddev.width - 80, 16, (u8 *)"无人", 16, 0); } LCD_Fill(70, 110, lcddev.width - 10, 126, WHITE); sprintf(buf, "%3d%%", smoke_percent); POINT_COLOR = BLACK; LCD_ShowString(70, 110, 80, 16, 16, (u8 *)buf); level = Smoke_LevelText(smoke_percent); Show_Str(150, 110, 100, 16, level, 16, 0); }
static void UI_UpdateEnvInuse(u8 human, u8 smoke_percent) { char buf[16]; u8 *level; LCD_Fill(70, 280, lcddev.width - 10, 296, WHITE); if (human) { POINT_COLOR = RED; Show_Str(70, 280, lcddev.width - 80, 16, (u8 *)"有人", 16, 0); } else { POINT_COLOR = BLACK; Show_Str(70, 280, lcddev.width - 80, 16, (u8 *)"无人", 16, 0); } LCD_Fill(70, 300, lcddev.width - 10, 316, WHITE); sprintf(buf, "%3d%%", smoke_percent); POINT_COLOR = BLACK; LCD_ShowString(70, 300, 80, 16, 16, (u8 *)buf); level = Smoke_LevelText(smoke_percent); Show_Str(150, 300, 100, 16, level, 16, 0); }
static void UI_UpdateStateLine(void) { u8 *text; POINT_COLOR = BLACK; BACK_COLOR = WHITE; LCD_Fill(80, 50, 310, 66, WHITE); if (g_app.state == STATE_IDLE) text = (u8 *)"待机"; else text = (u8 *)"上机中"; Show_Str(80, 50, 230, 16, text, 16, 0); }
static void UI_UpdateUserLine(void) { POINT_COLOR = BLACK; BACK_COLOR = WHITE; LCD_Fill(80, 70, 310, 86, WHITE); if (g_app.state == STATE_IDLE || g_app.has_user == 0) Show_Str(80, 70, 230, 16, (u8 *)"--", 16, 0); else Show_Str(80, 70, 230, 16, g_app.user_name, 16, 0); }
static void UI_UpdateCardLine(void) { char buf[24]; POINT_COLOR = BLACK; BACK_COLOR = WHITE; LCD_Fill(80, 90, 310, 106, WHITE); if (g_app.has_user) { sprintf(buf, "%02X %02X %02X %02X", g_app.uid[0], g_app.uid[1], g_app.uid[2], g_app.uid[3]); LCD_ShowString(80, 90, 230, 16, 16, (u8 *)buf); } else Show_Str(80, 90, 230, 16, (u8 *)"--", 16, 0); }
static void UI_UpdateBalanceLine(void) { char buf[24]; u32 yuan; u32 cent; POINT_COLOR = BLACK; BACK_COLOR = WHITE; LCD_Fill(80, 110, 310, 126, WHITE); yuan = g_app.balance / 100; cent = g_app.balance % 100; sprintf(buf, "%lu.%02lu 元", (unsigned long)yuan, (unsigned long)cent); Show_Str(80, 110, 230, 16, (u8 *)buf, 16, 0); }
// ★★★ 修改：使用动态费率计算费用 ★★★
static void UI_UpdateRuntimeAndFee(void) { u32 min; u32 sec; u32 fee; char buf[24]; min = g_app.used_seconds / 60; sec = g_app.used_seconds % 60; POINT_COLOR = BLACK; BACK_COLOR = WHITE; LCD_Fill(80, 130, 310, 146, WHITE); sprintf(buf, "%02lu:%02lu", min, sec); Show_Str(80, 130, 230, 16, (u8 *)buf, 16, 0); fee = (u32)((g_app.used_seconds / 60.0) * g_price_per_min); LCD_Fill(80, 150, 310, 166, WHITE); sprintf(buf, "%4lu 元", fee); Show_Str(80, 150, 230, 16, (u8 *)buf, 16, 0); }
static void UI_UpdatePCButton(void) { POINT_COLOR = BLACK; BACK_COLOR = WHITE; if (g_app.pc_on) { LCD_Fill(BTN_PC_X1 + 1, BTN_PC_Y1 + 1, BTN_PC_X2 - 1, BTN_PC_Y2 - 1, GREEN); Show_Str(BTN_PC_X1 + 20, BTN_PC_Y1 + 12, 100, 16, (u8 *)"关电脑", 16, 0); } else { LCD_Fill(BTN_PC_X1 + 1, BTN_PC_Y1 + 1, BTN_PC_X2 - 1, BTN_PC_Y2 - 1, GRAY); Show_Str(BTN_PC_X1 + 20, BTN_PC_Y1 + 12, 100, 16, (u8 *)"开电脑", 16, 0); } LCD_DrawRectangle(BTN_PC_X1, BTN_PC_Y1, BTN_PC_X2, BTN_PC_Y2); }
static void UI_UpdateLightButton(void) { POINT_COLOR = BLACK; BACK_COLOR = WHITE; if (g_app.light_on) { LCD_Fill(BTN_LIGHT_X1 + 1, BTN_LIGHT_Y1 + 1, BTN_LIGHT_X2 - 1, BTN_LIGHT_Y2 - 1, GREEN); Show_Str(BTN_LIGHT_X1 + 20, BTN_LIGHT_Y1 + 12, 100, 16, (u8 *)"关灯光", 16, 0); } else { LCD_Fill(BTN_LIGHT_X1 + 1, BTN_LIGHT_Y1 + 1, BTN_LIGHT_X2 - 1, BTN_LIGHT_Y2 - 1, GRAY); Show_Str(BTN_LIGHT_X1 + 20, BTN_LIGHT_Y1 + 12, 100, 16, (u8 *)"开灯光", 16, 0); } LCD_DrawRectangle(BTN_LIGHT_X1, BTN_LIGHT_Y1, BTN_LIGHT_X2, BTN_LIGHT_Y2); LCD_Fill(BTN_EXIT_X1 + 1, BTN_EXIT_Y1 + 1, BTN_EXIT_X2 - 1, BTN_EXIT_Y2 - 1, RED); POINT_COLOR = WHITE; BACK_COLOR = RED; Show_Str(BTN_EXIT_X1 + 20, BTN_EXIT_Y1 + 12, 120, 16, (u8 *)"下机结算", 16, 0); LCD_DrawRectangle(BTN_EXIT_X1, BTN_EXIT_Y1, BTN_EXIT_X2, BTN_EXIT_Y2); POINT_COLOR = BLACK; BACK_COLOR = WHITE; }
static void UI_UpdateWifiIcon(void) { WifiState_t cur; u16 base_x; u16 base_y; cur = ESP8266_GetState(); base_x = lcddev.width - 40; base_y = 6; POINT_COLOR = WHITE; BACK_COLOR = BLUE; LCD_Fill(lcddev.width - 70, 0, lcddev.width - 1, 30, BLUE); if (cur == WIFI_STATE_RUNNING) { LCD_Fill(base_x, base_y + 8, base_x + 6, base_y + 14, WHITE); LCD_Fill(base_x + 8, base_y + 4, base_x + 14, base_y + 14, WHITE); LCD_Fill(base_x + 16, base_y, base_x + 22, base_y + 14, WHITE); } else if (cur > WIFI_STATE_INIT && cur < WIFI_STATE_RUNNING) { LCD_Fill(base_x, base_y + 8, base_x + 6, base_y + 14, WHITE); LCD_Fill(base_x + 8, base_y + 4, base_x + 14, base_y + 14, WHITE); LCD_DrawRectangle(base_x + 16, base_y, base_x + 22, base_y + 14); } else { POINT_COLOR = WHITE; LCD_DrawLine(base_x, base_y, base_x + 15, base_y + 15); LCD_DrawLine(base_x, base_y + 15, base_x + 15, base_y); } POINT_COLOR = BLACK; BACK_COLOR = WHITE; }
static u8 Smoke_AdcToPercent(u16 adc) { if (adc <= 500) return 0; if (adc >= 3500) return 100; return (u8)((adc - 500) * 100 / (3500 - 500)); }
static u8* Smoke_LevelText(u8 percent) { if (percent < 30) return (u8 *)"良好"; else if (percent < 60) return (u8 *)"中等"; else if (percent < 80) return (u8 *)"较高"; else return (u8 *)"危险"; }
static void UID_ToHex(const u8 *uid, char *out) { sprintf(out, "%02X%02X%02X%02X", uid[0], uid[1], uid[2], uid[3]); }
static void App_OnCard(u8 *uid) { u8 i; char uid_hex[9]; char payload[32]; if (g_app.maint_mode) { UI_ShowServerMsg("座位维护中，暂不提供上机服务"); g_server_msg_secs = 5; return; } if (g_app.state == STATE_INUSE) { UI_ShowServerMsg("已在上机中"); g_server_msg_secs = 3; return; } for (i = 0; i < 4; i++) g_app.uid[i] = uid[i]; g_app.has_user = 1; UID_ToHex(uid, uid_hex); sprintf(payload, "uid=%s", uid_hex); if (ESP8266_GetState() == WIFI_STATE_RUNNING) { ESP8266_MQTT_Pub_Async("netbar/seat001/card", payload); g_wait_card_auth = 1; g_card_auth_tick = GetSysMs(); UI_ShowServerMsg("正在验证，请稍候..."); g_server_msg_secs = 5; } else { UI_ShowServerMsg("网络未连接，无法验证"); g_server_msg_secs = 5; } }
static void App_EndSession(void) { App_InitContext(); g_screen = SCREEN_WELCOME; g_confirm = CONFIRM_NONE; UI_DrawWelcomeStatic(); ESP8266_MQTT_Pub_Async("netbar/seat001/cmd", "checkout"); }
static void UI_ShowConfirmDialog(confirm_type_t type) { LCD_Fill(CONF_X1, CONF_Y1, CONF_X2, CONF_Y2, GRAY); LCD_DrawRectangle(CONF_X1, CONF_Y1, CONF_X2, CONF_Y2); POINT_COLOR = BLACK; BACK_COLOR = GRAY; if (type == CONFIRM_PC_OFF) Show_Str(CONF_X1 + 20, CONF_Y1 + 20, 220, 16, (u8 *)"确认关机？", 16, 0); else if (type == CONFIRM_EXIT) Show_Str(CONF_X1 + 20, CONF_Y1 + 20, 220, 16, (u8 *)"确认下机结算？", 16, 0); LCD_Fill(CONF_BTN_OK_X1, CONF_BTN_OK_Y1, CONF_BTN_OK_X2, CONF_BTN_OK_Y2, GREEN); POINT_COLOR = WHITE; BACK_COLOR = GREEN; Show_Str(CONF_BTN_OK_X1 + 8, CONF_BTN_OK_Y1 + 8, 80, 16, (u8 *)"确认", 16, 0); LCD_DrawRectangle(CONF_BTN_OK_X1, CONF_BTN_OK_Y1, CONF_BTN_OK_X2, CONF_BTN_OK_Y2); LCD_Fill(CONF_BTN_CANCEL_X1, CONF_BTN_CANCEL_Y1, CONF_BTN_CANCEL_X2, CONF_BTN_CANCEL_Y2, RED); POINT_COLOR = WHITE; BACK_COLOR = RED; Show_Str(CONF_BTN_CANCEL_X1 + 8, CONF_BTN_CANCEL_Y1 + 8, 80, 16, (u8 *)"取消", 16, 0); LCD_DrawRectangle(CONF_BTN_CANCEL_X1, CONF_BTN_CANCEL_Y1, CONF_BTN_CANCEL_X2, CONF_BTN_CANCEL_Y2); POINT_COLOR = BLACK; BACK_COLOR = WHITE; }
static void App_HandleTouch(void) { u8 is_down; u16 x, y; if (tp_dev.scan(0)) { is_down = (tp_dev.sta & TP_PRES_DOWN) ? 1 : 0; x = tp_dev.x[0]; y = tp_dev.y[0]; } else { is_down = 0; x = 0; y = 0; } if (is_down) { if (!g_touch_down) { g_touch_down = 1; if (g_screen == SCREEN_INUSE) { if ((x > BTN_PC_X1) && (x < BTN_PC_X2) && (y > BTN_PC_Y1) && (y < BTN_PC_Y2)) { if (!g_app.pc_on) { g_app.pc_on = 1; Seat_PC_Set(1); UI_UpdatePCButton(); } else { g_confirm = CONFIRM_PC_OFF; g_screen = SCREEN_CONFIRM; UI_ShowConfirmDialog(g_confirm); } } else if ((x > BTN_LIGHT_X1) && (x < BTN_LIGHT_X2) && (y > BTN_LIGHT_Y1) && (y < BTN_LIGHT_Y2)) { g_app.light_on = g_app.light_on ? 0 : 1; Seat_Light_Set(g_app.light_on); UI_UpdateLightButton(); } else if ((x > BTN_EXIT_X1) && (x < BTN_EXIT_X2) && (y > BTN_EXIT_Y1) && (y < BTN_EXIT_Y2)) { if (g_app.state == STATE_INUSE) { g_confirm = CONFIRM_EXIT; g_screen = SCREEN_CONFIRM; UI_ShowConfirmDialog(g_confirm); } } } else if (g_screen == SCREEN_CONFIRM) { if ((x > CONF_BTN_OK_X1) && (x < CONF_BTN_OK_X2) && (y > CONF_BTN_OK_Y1) && (y < CONF_BTN_OK_Y2)) { if (g_confirm == CONFIRM_PC_OFF) { g_app.pc_on = 0; Seat_PC_Set(0); g_screen = SCREEN_INUSE; g_confirm = CONFIRM_NONE; UI_DrawInuseStatic(); UI_UpdateStateLine(); UI_UpdateUserLine(); UI_UpdateCardLine(); UI_UpdateBalanceLine(); UI_UpdateRuntimeAndFee(); UI_UpdatePCButton(); UI_UpdateLightButton(); } else if (g_confirm == CONFIRM_EXIT) App_EndSession(); } else if ((x > CONF_BTN_CANCEL_X1) && (x < CONF_BTN_CANCEL_X2) && (y > CONF_BTN_CANCEL_Y1) && (y < CONF_BTN_CANCEL_Y2)) { g_screen = SCREEN_INUSE; g_confirm = CONFIRM_NONE; UI_DrawInuseStatic(); UI_UpdateStateLine(); UI_UpdateUserLine(); UI_UpdateCardLine(); UI_UpdateBalanceLine(); UI_UpdateRuntimeAndFee(); UI_UpdatePCButton(); UI_UpdateLightButton(); } } } } else g_touch_down = 0; }

static void Netbar_Publish_SeatState(void) { char payload[96]; u8 human; u16 smoke_adc; u8 smoke_percent; u8 iu; u32 used_seconds; u32 fee; u8 alarm_active; if (ESP8266_GetState() != WIFI_STATE_RUNNING) return; human = Seat_Radar_Get(); smoke_adc = Seat_Smoke_GetRaw(); smoke_percent = Smoke_AdcToPercent(smoke_adc); iu = (g_app.state == STATE_INUSE) ? 1 : 0; used_seconds = g_app.used_seconds; fee = (u32)((used_seconds / 60.0) * g_price_per_min); alarm_active = g_idle_occupy_alarm || g_smoke_alarm; sprintf(payload, "s=1;iu=%d;pc=%d;lt=%d;hm=%d;sm=%d;sec=%lu;fee=%lu;al=%d", iu, g_app.pc_on, g_app.light_on, human, smoke_percent, used_seconds, fee, alarm_active); publish_seq++; ESP8266_MQTT_Pub_Async("netbar/seat001/state", payload); }

static void UID_HexStr_To_Bytes(const char *str, u8 *out_uid) {
    int i;
    unsigned int val;
    for (i = 0; i < 4; i++) {
        if (sscanf(str + i * 2, "%02x", &val) == 1) {
            out_uid[i] = (u8)val;
        } else {
            out_uid[i] = 0;
        }
    }
}
